brew "bat"
brew "curl"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "sshs"
brew "tmux"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "font-meslo-lg-nerd-font"
